### Pandas
      - It means panel data.
      - It is one of the data science package.
      - used for data analysis, manuplication and cleaning.
      - It contains 2 data sructures in pandas.
           - series   - sequence of data.
           - dataframes :- Data frame is a data with row and column.

# Installation
    * pip install pandas

In [1]:
# how to import pandas
import pandas

In [3]:
import pandas as pd

# pandas series data structure
      - syntax :- pd.Series(data,index,dtype)

In [11]:
s = "hello"
print(s)
pd.Series(s)

hello

0    hello
dtype: object

In [10]:
s1 = "hi hello gd afternon".split()
print(s1)
pd.Series(s1)

['hi', 'hello', 'gd', 'afternon']

0          hi
1       hello
2          gd
3    afternon
dtype: object

In [12]:
print(s1)
pd.Series(s1,index=['a','b','c','d'])

['hi', 'hello', 'gd', 'afternon']

a          hi
b       hello
c          gd
d    afternon
dtype: object

In [13]:
li = [3,4,6,'a','n',7,8]
print(li)
pd.Series(li)

[3, 4, 6, 'a', 'n', 7, 8]

0    3
1    4
2    6
3    a
4    n
5    7
6    8
dtype: object

In [19]:
t = (1,2,3,'e',4,6,7,'w','f')
print(t)
print(type(t))
r = pd.Series(t)
print(r)
print(type(r))

(1, 2, 3, 'e', 4, 6, 7, 'w', 'f')
<class 'tuple'>
0    1
1    2
2    3
3    e
4    4
5    6
6    7
7    w
8    f
dtype: object
<class 'pandas.core.series.Series'>

In [21]:
d = {'key1':123,'key2':'hello','key3':'hiii'}
print(d)
pd.Series(d)

{'key1': 123, 'key2': 'hello', 'key3': 'hiii'}

key1      123
key2    hello
key3     hiii
dtype: object

## Pandas DataFrames

In [22]:
s = "Welcome to python programming internship".split()
pd.DataFrame(s)

             0
0      Welcome
1           to
2       python
3  programming
4   internship

In [25]:
li = [[1,2,3],[4,5,6]]
j = pd.DataFrame(li,index=['list1','list2'])
print(j)
print(type(j))

       0  1  2
list1  1  2  3
list2  4  5  6
<class 'pandas.core.frame.DataFrame'>

In [27]:
d = {'k1':'h1','k2':'h2','k3':'h3'}
pd.DataFrame(d,index=[1,2,3])

   k1  k2  k3
1  h1  h2  h3
2  h1  h2  h3
3  h1  h2  h3

In [33]:
dic = {'Name':['raju','ravi','rani','vamsi'],
      'Marks':[90,89,94,100],'ID':[101,102,103,104]}
df1 = pd.DataFrame(dic,index = ['std1','std2','std3','std4'])
print(df1)

       Name  Marks   ID
std1   raju     90  101
std2   ravi     89  102
std3   rani     94  103
std4  vamsi    100  104

In [30]:
# creation 
import numpy as np
import pandas as pd
k = np.array([[23,45,77],[44,78,28]])
print(k,type(k))
j = pd.DataFrame(k)
print(j,type(j))

[[23 45 77]
 [44 78 28]] <class 'numpy.ndarray'>
    0   1   2
0  23  45  77
1  44  78  28 <class 'pandas.core.frame.DataFrame'>

In [34]:
print(df1)

       Name  Marks   ID
std1   raju     90  101
std2   ravi     89  102
std3   rani     94  103
std4  vamsi    100  104

In [36]:
# to get only columns
df1.columns

Index(['Name', 'Marks', 'ID'], dtype='object')

In [37]:
# to get no of records
print(len(df1.values))

4

In [38]:
# to get the row values
df1.values

array([['raju', 90, 101],
       ['ravi', 89, 102],
       ['rani', 94, 103],
       ['vamsi', 100, 104]], dtype=object)

In [41]:
# to get the index positions
print(df1.index)

Index(['std1', 'std2', 'std3', 'std4'], dtype='object')

In [42]:
# to get no of rows and no of columns
print(df1.shape)

(4, 3)

In [45]:
print(df1['Name'])

std1     raju
std2     ravi
std3     rani
std4    vamsi
Name: Name, dtype: object

In [46]:
print(df1['Marks'])

std1     90
std2     89
std3     94
std4    100
Name: Marks, dtype: int64

In [48]:
print(df1[['Marks','ID']])

      Marks   ID
std1     90  101
std2     89  102
std3     94  103
std4    100  104

In [49]:
# head()   - to get first 5 records
df1.head()

       Name  Marks   ID
std1   raju     90  101
std2   ravi     89  102
std3   rani     94  103
std4  vamsi    100  104

In [50]:
df1.head(2)

      Name  Marks   ID
std1  raju     90  101
std2  ravi     89  102

In [51]:
df1.head(1)

      Name  Marks   ID
std1  raju     90  101

In [52]:
df1.tail()

       Name  Marks   ID
std1   raju     90  101
std2   ravi     89  102
std3   rani     94  103
std4  vamsi    100  104

In [53]:
df1.tail(1)

       Name  Marks   ID
std4  vamsi    100  104

In [54]:
df1.tail(2)

       Name  Marks   ID
std3   rani     94  103
std4  vamsi    100  104

In [62]:
# to adding new record to the data frame
df1.loc[4]=['sony',78,105]
print(df1)

       Name  Marks   ID
std1   raju     90  101
std2   ravi     89  102
std3   rani     94  103
std4  vamsi    100  104
4      sony     78  105
5      sony     78  105
8      sony     78  105
6      sony     78  105

In [64]:
# to add new column
df1['Branch']=['ece','cse','mech','civil','eee','ece','cse','mech']
df1

       Name  Marks   ID Branch
std1   raju     90  101    ece
std2   ravi     89  102    cse
std3   rani     94  103   mech
std4  vamsi    100  104  civil
4      sony     78  105    eee
5      sony     78  105    ece
8      sony     78  105    cse
6      sony     78  105   mech

In [66]:
# particular value update in DATAFRAME
df1.loc['std4','Branch']='Arts'
df1

       Name  Marks   ID Branch
std1   raju     90  101    ece
std2   ravi     89  102    cse
std3   rani     94  103   mech
std4  vamsi    100  104   Arts
4      sony     78  105    eee
5      sony     78  105    ece
8      sony     78  105    cse
6      sony     78  105   mech

In [67]:
# to get particular record details
df1.loc['std2']

Name      ravi
Marks       89
ID         102
Branch     cse
Name: std2, dtype: object

In [68]:
df1.loc[4]

Name      sony
Marks       78
ID         105
Branch     eee
Name: 4, dtype: object

In [75]:
# how to delete particular row or column  -  drop()
# row wise ---- axis = 0
# column wise ---- axis = 1
print(df1)

       Name  Marks Branch
std1   raju     90    ece
std2   ravi     89    cse
std3   rani     94   mech
std4  vamsi    100   Arts
5      sony     78    ece
6      sony     78   mech

In [73]:
# how o delete particular row
df1 = df1.drop(8,axis=0)
df1

       Name  Marks   ID Branch
std1   raju     90  101    ece
std2   ravi     89  102    cse
std3   rani     94  103   mech
std4  vamsi    100  104   Arts
5      sony     78  105    ece
6      sony     78  105   mech

In [74]:
# paticular column delete
df1 = df1.drop('ID',axis = 1)
df1

       Name  Marks Branch
std1   raju     90    ece
std2   ravi     89    cse
std3   rani     94   mech
std4  vamsi    100   Arts
5      sony     78    ece
6      sony     78   mech

In [80]:
# to remove the particular single column name
df1.rename(columns={'Marks':'MARKS'},inplace=True)
df1

Empty DataFrame
Columns: [Name, MARKS, Branch]
Index: []

In [79]:
# to delete all records
df1.drop(df1.index,inplace=True)
df1

Empty DataFrame
Columns: [Name, Marks, Branch]
Index: []

In [81]:
# to delete all columns
df1.drop(df1.columns,inplace=True,axis=1)
df1

Empty DataFrame
Columns: []
Index: []